# Как переводить документацию

Файлы русскоязычной документации имеют определенный формат. В начале каждого файла должна быть конструкция следующего вида:

```markdown
<!--- EN-Revision: dc50a6f33d473a8fb2f4d87876c09ab296e8d859 -->

## Начало перевода 
```

где ``dc50a6f33d473a8fb2f4d87876c09ab296e8d859`` – хэш sha оригинального файла, указанный на старнице со [статусом перевода](https://ru-docs.ru/project/1). 

Обратите внимание, что между тэгом ревизии и началом перевода пустая строка.

Из перевода убираются мета-данные исходного файла, например,

```bash
–––
title: Managed and Bare Workflows
–––
```